#Brewfile for macOS
#Install Homebrew
#xcode-select --install
#/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install.sh)"
#brew install mas
#To process the Brewfile in the current directory:
#brew bundle
#Or use --file to specify a path to a different Brewfile
#brew bundle --file somefile
#
#For Homebrew documentation see
#https://docs.brew.sh/Manpage
tap "homebrew/cask"
tap "brewsci/bio"
cask_args appdir: "/Applications"

#OpenJDK8 required for nextflow
cask "homebrew/cask-versions/adoptopenjdk8"

#Java required prokka, snpeff
cask "java"

#Command line
#For listing of all packages available from the core tap via the Homebrew package manager for macOS see:
#https://formulae.brew.sh/formula/
#
#For listing of Homebrew packages on current system:
#brew list
brew "bash"
brew "bedtools"
brew "blast"
brew "boost"
brew "cairo"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "findutils"
brew "gawk"
brew "gcc"
brew "gdk-pixbuf"
brew "gifsicle"
brew "git"
brew "gnuplot"
brew "igv"
brew "imagemagick"
brew "libffi"
brew "maven"
brew "mplayer"
brew "node"
brew "openssl"
brew "pandoc"
brew "pango"
brew "parallel"
brew "perltidy"
brew "poppler"
brew "prettier"
brew "python3"
brew "r"
brew "rclone"
brew "rename"
brew "sqlite"
brew "subversion"
brew "tidy-html5"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "youtube-dl"

#For listing of packages available from the brewsci/bio tap see:
#https://github.com/brewsci/homebrew-bio/tree/develop/Formula
brew "bioperl"
brew "blat"
brew "clustal-w"
brew "emboss"
brew "muscle"
brew "nextflow"
brew "prokka"
brew "snpeff"

#GUI
#For a listing of all casks available from the cask tap via the Homebrew package manager for macOS see:
#https://formulae.brew.sh/cask/
#
#For listing of Homebrew casks on current system:
#brew cask list
cask "adobe-acrobat-reader"
cask "alacritty"
cask "basictex"
cask "clipy"
cask "dash"
cask "docker"
cask "dropbox"
cask "eclipse-java"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "google-drive-file-stream"
cask "inkscape"
cask "iterm2"
cask "keepassxc"
cask "libreoffice"
cask "macdown"
cask "microsoft-office"
cask "microsoft-teams"
cask "openemu"
cask "openoffice"
cask "paparazzi"
cask "rstudio"
cask "skype"
cask "skype-for-business"
cask "spotify"
cask "steam"
cask "termius"
cask "textmate"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "wkhtmltopdf"
cask "xquartz"

#Mac App Store
#To obtain IDs of installed Mac App Store software:
#brew install mas
#mas list
mas "Affinity Photo", id: 824183456
mas "BetterSnapTool", id: 417375580
mas "Day One", id: 1055511498
mas "Display Menu", id: 549083868
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Termius - SSH client", id: 1176074088
mas "The Unarchiver", id: 425424353
mas "ToothFairy", id: 1191449274
